RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_comp.h
/**
  **********************************************************************************************************************
  * @file    stm32h5xx_ll_comp.h
  * @author  MCD Application Team
  * @brief   Header file of COMP LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef __STM32H5xx_LL_COMP_H
#define __STM32H5xx_LL_COMP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32h5xx.h"

/** @addtogroup STM32H5xx_LL_Driver
  * @{
  */

#if defined (COMP1)

/** @defgroup COMP_LL COMP
  * @{
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup COMP_LL_Private_Constants COMP Private Constants
  * @{
  */

/* COMP registers bits positions */
#define LL_COMP_OUTPUT_LEVEL_BITOFFSET_POS (30U) /* Value equivalent to POSITION_VAL(COMP_CSR_VALUE) */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/* Exported types ----------------------------------------------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup COMP_LL_ES_INIT COMP Exported Init structure
  * @{
  */

/**
  * @brief  Structure definition of some features of COMP instance.
  */
typedef struct
{
  uint32_t PowerMode;             /*!< Set comparator operating mode to adjust power and speed.
                                       This parameter can be a value of @ref COMP_LL_EC_POWERMODE
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetPowerMode().                                          */

  uint32_t InputPlus;             /*!< Set comparator input plus (non-inverting input).
                                       This parameter can be a value of @ref COMP_LL_EC_INPUT_PLUS
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetInputPlus(). */

  uint32_t InputMinus;            /*!< Set comparator input minus (inverting input).
                                       This parameter can be a value of @ref COMP_LL_EC_INPUT_MINUS
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetInputMinus().                                         */

  uint32_t InputHysteresis;       /*!< Set comparator hysteresis mode of the input minus.
                                       This parameter can be a value of @ref COMP_LL_EC_INPUT_HYSTERESIS
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetInputHysteresis().                                    */

  uint32_t OutputPolarity;        /*!< Set comparator output polarity.
                                       This parameter can be a value of @ref COMP_LL_EC_OUTPUT_POLARITY
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetOutputPolarity().                                     */

  uint32_t OutputBlankingSource;  /*!< Set comparator blanking source.
                                       This parameter can be a value of @ref COMP_LL_EC_OUTPUT_BLANKING_SOURCE
                                       This feature can be modified afterwards using unitary
                                       function @ref LL_COMP_SetOutputBlankingSource().                               */
} LL_COMP_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_LL_EC_POWERMODE Comparator modes - Power mode
  * @{
  */
#define LL_COMP_POWERMODE_HIGHSPEED     (0x00000000UL)            /*!< COMP power mode to high speed      */
#define LL_COMP_POWERMODE_MEDIUMSPEED   (COMP_CFGR1_PWRMODE_0)    /*!< COMP power mode to medium speed    */
#define LL_COMP_POWERMODE_ULTRALOWPOWER (COMP_CFGR1_PWRMODE_1 |\
                                         COMP_CFGR1_PWRMODE_0)    /*!< COMP power mode to ultra-low power */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO1          (0x00000000UL)          /*!< Comparator input plus connected to IO1 (pin PB0) */
#define LL_COMP_INPUT_PLUS_IO2          (COMP_CFGR2_INPSEL0)    /*!< Comparator input plus connected to IO2 (pin PA0) */
#define LL_COMP_INPUT_PLUS_IO3          (COMP_CFGR1_INPSEL1)    /*!< Comparator input plus connected to IO3 (pin PB2) */
#define LL_COMP_INPUT_PLUS_DAC1_CH1     (COMP_CFGR1_INPSEL2)    /*!< Comparator input plus connected to DAC1 channel 1 */
/**
  * @}
  */

