RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_comp.h
/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_1_4VREFINT  (COMP_CFGR1_SCALEN |\
                                         COMP_CFGR1_BRGEN)      /*!< Comparator input minus connected to 1/4 VrefInt */
#define LL_COMP_INPUT_MINUS_1_2VREFINT  (COMP_CFGR1_INMSEL_0 |\
                                         COMP_CFGR1_SCALEN |\
                                         COMP_CFGR1_BRGEN)      /*!< Comparator input minus connected to 1/2 VrefInt */
#define LL_COMP_INPUT_MINUS_3_4VREFINT  (COMP_CFGR1_INMSEL_1 |\
                                         COMP_CFGR1_SCALEN |\
                                         COMP_CFGR1_BRGEN)      /*!< Comparator input minus connected to 3/4 VrefInt */
#define LL_COMP_INPUT_MINUS_VREFINT     (COMP_CFGR1_INMSEL_1 |\
                                         COMP_CFGR1_INMSEL_0 |\
                                         COMP_CFGR1_SCALEN)     /*!< Comparator input minus connected to VrefInt */
#define LL_COMP_INPUT_MINUS_DAC1_CH1    (COMP_CFGR1_INMSEL_2)   /*!< Comparator input minus connected to DAC1
                                                                     channel 1 (DAC_OUT1) */
#define LL_COMP_INPUT_MINUS_IO1         (COMP_CFGR1_INMSEL_2 |\
                                         COMP_CFGR1_INMSEL_0)   /*!< Comparator input minus connected to pin PC4 */
#define LL_COMP_INPUT_MINUS_IO2         (COMP_CFGR1_INMSEL_2 |\
                                         COMP_CFGR1_INMSEL_1)   /*!< Comparator input minus connected to pin PB1 */
#define LL_COMP_INPUT_MINUS_IO3         (COMP_CFGR1_INMSEL_2 |\
                                         COMP_CFGR1_INMSEL_1 |\
                                         COMP_CFGR1_INMSEL_0)   /*!< Comparator input minus connected to pin PA5 */
#define LL_COMP_INPUT_MINUS_TEMPSENSOR  (COMP_CFGR1_INMSEL_3)   /*!< Comparator input minus connected to internal
                                        temperature sensor (also accessible through ADC peripheral) */
#define LL_COMP_INPUT_MINUS_VBAT        (COMP_CFGR1_INMSEL_3 |\
                                         COMP_CFGR1_INMSEL_0)   /*!< Comparator input minus connected to Vbat/4:
                                        Vbat voltage through a divider ladder of factor 1/4 to have input voltage
                                        always below Vdda. */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_HYSTERESIS Comparator input - Hysteresis
  * @{
  */
#define LL_COMP_HYSTERESIS_NONE         (0x00000000UL)                          /*!< No hysteresis */
#define LL_COMP_HYSTERESIS_LOW          (COMP_CFGR1_HYST_0)                     /*!< Hysteresis level low */
#define LL_COMP_HYSTERESIS_MEDIUM       (COMP_CFGR1_HYST_1)                     /*!< Hysteresis level medium */
#define LL_COMP_HYSTERESIS_HIGH         (COMP_CFGR1_HYST_1 | COMP_CFGR1_HYST_0) /*!< Hysteresis level high */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED   (0x00000000UL)          /*!< COMP output polarity is not inverted: comparator
                                                                     output is high when the plus (non-inverting) input
                                                                     is at a higher voltage than the
                                                                     minus (inverting) input                          */
#define LL_COMP_OUTPUTPOL_INVERTED      (COMP_CFGR1_POLARITY)   /*!< COMP output polarity is inverted: comparator output
                                                                     is low when the plus (non-inverting) input is at a
                                                                     lower voltage than the minus (inverting) input   */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_BLANKING_SOURCE Comparator output - Blanking source
  * @{
  */
#define LL_COMP_BLANKINGSRC_NONE         ((uint32_t)0x00000000)    /*!<Comparator output without blanking */
#define LL_COMP_BLANKINGSRC_TIM1_OC5     (COMP_CFGR1_BLANKING_0)   /*!< Comparator output blanking source TIM1 OC5 */
#define LL_COMP_BLANKINGSRC_TIM2_OC3     (COMP_CFGR1_BLANKING_1)   /*!< Comparator output blanking source TIM2 OC3 */
#define LL_COMP_BLANKINGSRC_TIM3_OC3     (COMP_CFGR1_BLANKING_0 |\
                                          COMP_CFGR1_BLANKING_1)   /*!< Comparator output blanking source TIM3 OC3 */
#define LL_COMP_BLANKINGSRC_TIM3_OC4     (COMP_CFGR1_BLANKING_2)   /*!< Comparator output blanking source TIM3 OC4 */
#define LL_COMP_BLANKINGSRC_LPTIM1_OC2   (COMP_CFGR1_BLANKING_2 |\
                                          COMP_CFGR1_BLANKING_0)   /*!< Comparator output blanking source LPTIM1 OC2 */
#define LL_COMP_BLANKINGSRC_LPTIM2_OC2   (COMP_CFGR1_BLANKING_2 |\
                                          COMP_CFGR1_BLANKING_1)   /*!< Comparator output blanking source LPTIM2 OC2 */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW           (0x00000000UL)  /*!< Comparator output level low (if polarity not inverted,
                                            otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH          (0x00000001UL)  /*!< Comparator output level high (if polarity not inverted,
                                           otherwise to be complemented) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_HW_DELAYS  Definitions of COMP hardware constraints delays
  * @note   Only COMP peripheral HW delays are defined in COMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for comparator startup time.                                         */
/* Note: Delay required to reach propagation delay specification.             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define LL_COMP_DELAY_STARTUP_US          ( 80UL) /*!< Delay for COMP startup time */

